In [2]:
!pip install sqlalchemy==1.3.9

Collecting sqlalchemy==1.3.9
  Downloading SQLAlchemy-1.3.9.tar.gz (6.0 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 6.0/6.0 MB 82.8 MB/s eta 0:00:00:00:0100:01
  Preparing metadata (setup.py) ... done
Building wheels for collected packages: sqlalchemy
  Building wheel for sqlalchemy (setup.py) ... done
  Created wheel for sqlalchemy: filename=SQLAlchemy-1.3.9-cp37-cp37m-linux_x86_64.whl size=1159121 sha256=f9be523f2d80707896cb0341fc19cd50066482693869e56ef9c731e2a655dc66
  Stored in directory: /home/jupyterlab/.cache/pip/wheels/03/71/13/010faf12246f72dc76b4150e6e599d13a85b4435e06fb9e51f
Successfully built sqlalchemy
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.3.24
    Uninstalling SQLAlchemy-1.3.24:
      Successfully uninstalled SQLAlchemy-1.3.24
Successfully installed sqlalchemy-1.3.9

In [3]:
%load_ext sql

In [4]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [5]:
!pip install -q pandas==1.1.5

In [6]:
%sql sqlite:///my_data1.db

'Connected: @my_data1.db'

In [7]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

/home/jupyterlab/conda/envs/python/lib/python3.7/site-packages/pandas/core/generic.py:2882: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  both result in 0.1234 being formatted as 0.12.

In [8]:
### code is added to remove blank rows from table

%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

 * sqlite:///my_data1.db
(sqlite3.OperationalError) table SPACEXTABLE already exists
[SQL: create table SPACEXTABLE as select * from SPACEXTBL where Date is not null]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [8]:
### Task 1: Display the names of the unique launch sites in the space mission

In [29]:
%sql SELECT DISTINCT(LAUNCH_SITE) FROM SPACEXTBL;

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]

In [ ]:
### Task 2: Display 5 records where launch sites begin with the string 'CCA'

In [56]:
%sql SELECT * FROM SPACEXTBL WHERE (LAUNCH_SITE) LIKE 'CCA%' LIMIT 5;

 * sqlite:///my_data1.db
Done.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-03-01', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

In [20]:
### Task 3: Display the total payload mass carried by boosters launched by NASA (CRS)

In [30]:
%sql SELECT SUM(PAYLOAD_MASS__KG_) AS payloadmass FROM SPACEXTBL;

 * sqlite:///my_data1.db
Done.

[(619967,)]

In [22]:
### Task 4: Display average payload mass carried by booster version F9 v1.1

In [31]:
%sql SELECT AVG(PAYLOAD_MASS__KG_) AS payload_mass FROM SPACEXTBL;

 * sqlite:///my_data1.db
Done.

[(6138.287128712871,)]

In [25]:
### Task 5: List the date when the first succesful landing outcome in ground pad was acheived.

In [32]:
%sql SELECT MIN(Date) FROM SPACEXTBL;

 * sqlite:///my_data1.db
Done.

[('2010-06-04',)]

In [27]:
### Task 6: List the names of the boosters which have success in drone ship and 
### have payload mass greater than 4000 but less than 6000

In [17]:
%sql SELECT BOOSTER_VERSION FROM SPACEXTBL WHERE Mission_Outcome = 'Success' \
AND PAYLOAD_MASS__KG_ BETWEEN 4000 AND 6000;

 * sqlite:///my_data1.db
Done.

[('F9 v1.1',),
 ('F9 v1.1 B1011',),
 ('F9 v1.1 B1014',),
 ('F9 v1.1 B1016',),
 ('F9 FT B1020',),
 ('F9 FT B1022',),
 ('F9 FT B1026',),
 ('F9 FT B1030',),
 ('F9 FT  B1021.2',),
 ('F9 FT B1032.1',),
 ('F9 B4 B1040.1',),
 ('F9 FT  B1031.2',),
 ('F9 FT  B1032.2',),
 ('F9 B4  B1040.2',),
 ('F9 B5 B1046.2',),
 ('F9 B5 B1047.2',),
 ('F9 B5 B1046.3',),
 ('F9 B5 B1048.3',),
 ('F9 B5 B1051.2 ',),
 ('F9 B5B1060.1',),
 ('F9 B5 B1058.2 ',),
 ('F9 B5B1062.1',)]

In [28]:
### Task 7: List the total number of successful and failure mission outcomes

In [11]:
%sql SELECT COUNT(Mission_Outcome) AS Mission_Outcomes FROM SPACEXTBL WHERE "Mission_Outcome" = 'Success'

 * sqlite:///my_data1.db
Done.

[(98,)]

In [ ]:
### Task 8: List the names of the booster_versions which have carried the maximum payload mass use a subquery

In [57]:
%sql SELECT BOOSTER_VERSION FROM SPACEXTBL \
WHERE PAYLOAD_MASS__KG_ = (SELECT MAX(PAYLOAD_MASS__KG_) FROM SPACEXTBL);

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4',),
 ('F9 B5 B1049.4',),
 ('F9 B5 B1051.3',),
 ('F9 B5 B1056.4',),
 ('F9 B5 B1048.5',),
 ('F9 B5 B1051.4',),
 ('F9 B5 B1049.5',),
 ('F9 B5 B1060.2 ',),
 ('F9 B5 B1058.3 ',),
 ('F9 B5 B1051.6',),
 ('F9 B5 B1060.3',),
 ('F9 B5 B1049.7 ',)]

In [35]:
### Task 9: List the records which will display the month names, failure landing_outcomes in drone ship,
###         booster versions, launch_site for the months in year 2015.

In [64]:
%sql SELECT substr(Date,4,2) AS Month, BOOSTER_VERSION, LAUNCH_SITE, Landing_Outcome \
FROM SPACEXTBL WHERE Landing_Outcome = 'Failure' AND substr(Date,7,4)='2015';

 * sqlite:///my_data1.db
Done.

[]

In [37]:
### Task 10: Rank the count of successful landing_outcomes between the date 2010-06-04 and 2017-03-20 
###  in descending order.

In [52]:
%sql SELECT Mission_Outcome, Date FROM SPACEXTBL WHERE DATE BETWEEN '2010-06-04' AND '2017-03-20' ORDER BY DATE DESC;

 * sqlite:///my_data1.db
Done.

[('Success', '2017-03-16'),
 ('Success', '2017-02-19'),
 ('Success', '2017-01-14'),
 ('Success', '2016-08-14'),
 ('Success', '2016-07-18'),
 ('Success', '2016-06-15'),
 ('Success', '2016-05-27'),
 ('Success', '2016-05-06'),
 ('Success', '2016-04-08'),
 ('Success', '2016-03-04'),
 ('Success', '2016-01-17'),
 ('Success', '2015-12-22'),
 ('Failure (in flight)', '2015-06-28'),
 ('Success', '2015-04-27'),
 ('Success', '2015-04-14'),
 ('Success', '2015-03-02'),
 ('Success', '2015-02-11'),
 ('Success', '2015-01-10'),
 ('Success', '2014-09-21'),
 ('Success', '2014-09-07'),
 ('Success', '2014-08-05'),
 ('Success', '2014-07-14'),
 ('Success', '2014-04-18'),
 ('Success', '2014-01-06'),
 ('Success', '2013-12-03'),
 ('Success', '2013-09-29'),
 ('Success', '2013-03-01'),
 ('Success', '2012-10-08'),
 ('Success', '2012-05-22'),
 ('Success', '2010-12-08'),
 ('Success', '2010-06-04')]